app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["content", "リヴァイ888"], ["created_at", "2021-04-09 17:52:49.227946"], ["updated_at", "2021-04-09 17:52:49.227946"]]
---
  def create
    @post = Post.new(post_params)
    # if params[:back]
    #   render :new
    # else
      if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
  def set_params
    @post = Post.find(params[:id])